Repository: Muhammadhusnain01/d6-website
Catalog: sites/all/modules/comment_mover/translations/comment_mover.*.po
Languages: pt_pt

source: Comment mover enables you to move comments and nodes around by pruning and grafting. Pruning and grafting are similar to cut and paste but operate on branches, not on single comments. If you prune and graft a comment thread, the entire thread will be moved, not just the pruned comment.
pt_pt: O modulo Comment mover permite-lhe mover, podar, e enxertar comentários e nós. Podar e enxertar têm um comportamento semelhante a copiar e colar mas operam em ramos, não em comentários singulares. Se podar e enxertar uma lista de comentários, todo a lista será movida, e não apenas o comentário podado.

source: Basic use is simple; it starts by pruning a node or comment via the link prune. The pruned node/comment now appears in the Graft block. The graft block shows the title and author of the pruned content and always allows you to cancel the action. You can now navigate through your site and choose one of two options: grafting or conversion.
pt_pt: O uso básico é simples; comece por podar um nó ou comentário através do linque 'podar'. O nó/comentário aparece no bloco de Enxertos. O bloco de Enxerto mostra o título e o autor do conteúdo podado e permite-lhe cancelar a ação. Pode assim navegar pela sua página e escolher uma de duas opções: enxertar ou converter.

source: Grafting is a simple matter: simply click the graft link on the content (comment or node) you want the pruned object to reside under. All childcomments will be moved together with the pruned node or comment
pt_pt: Enxertar é fácil: simplesmente clique no linque 'enxertar' no conteúdo (comentário ou nó) onde pretende que o objecto podado seja realojado. Todos os comentários relacionados serão movidos com o nó/comentário podado.

source: If you just pruned a comment and enabled story and page under "Enable promotion to the following node types" on the <a href="@url">comment mover settings page</a>, the graft block also shows you story and page in the selection of node types to which the comment can be converted. When you then, for example, select story and click convert, a story submission form will appear with prefilled fields. Edit if necessary, then click submit. A new story node will be created. All children of the original comment will be moved to the new node.
pt_pt: Se podou um comentário e activou História e Página em "Activar promoção para os seguintes tipos de nó" na <a href="@url">página de configuração do comment mover</a>, o bloco enxertado também mostra História e Página na seleção de tipos de nó para o qual o comentário pode ser convertido. Assim, quando por exemplo selecionar História e clica em converter, aparecer-lhe-á um formulário de submissão de História com campos pré-preenchidos. Edite se necessário, e de seguida prima enviar. Um novo nó do tipo História será criado. Todos os filhos do comentário original serão movidos para o novo nó.

source: When you move a comment to another node or convert it to a node, the original comment will contain a link pointing to the comments new location. When you move a node to become a comment on another node, the original node will contain a redirect to the new location.
pt_pt: Quando move um comentário para outro nó ou o converte para nó, o comentário original vai conter um linque que aponta para a nova localização dos comentários. Quando move um nó que passa a comentário num outro nó, o nó original irá conter um redirecionamento para a nova localização.

source: graft
pt_pt: enxertar

source: prune
pt_pt: podar

source: Graft
pt_pt: Enxertar

source: Prune
pt_pt: Podar

source: Convert to
pt_pt: Converter para

source: Convert
pt_pt: Converter

source: Author has been set to %username.
pt_pt: %username foi definido como autor.

source: Submit %name
pt_pt: Submeter %name

source: This comment has been moved <a href="@url">here</a>.
pt_pt: Este comentário foi movido para <a href="@url">aqui</a>.

source: comment cannot be grafted on one of its children
pt_pt: o comentário não pode ser enxertado num dos seus filhos

source: Pruning %title.
pt_pt: Podando %title.

source: Unable to prune the post.
pt_pt: Incapaz de podar o post.

source: Are you sure you want to move this post here?
pt_pt: Tem a certeza que quer mover este post para aqui?

source: Grafted %title.
pt_pt: Enxertado %title.

source: Unable to move the post.
pt_pt: Incapaz de mover o post.

source: Comment mover clipboard
pt_pt: Área de transferência de Comment mover

source: By !author @date
pt_pt: Por !author @date

source: cancel
pt_pt: cancelar

source: Enable pruning of the following node types
pt_pt: Activar poda para os seguintes tipos de nó

source: Define the node types that can be pruned. Note that pruning doesn't make sense for certain node types (poll, for example).
pt_pt: Defina os tipos de nó que podem ser podados. Note que podar não faz sentido para certos tipos de nós (votações, por exemplo).

source: Enable pruning of comments on the following node types
pt_pt: Activar poda de comentários nos seguintes tipos de nó

source: Allow comments on these node types to be pruned and moved to other nodes or be promoted to a node.
pt_pt: Permitir que os comentários nestes tipos de nós sejam podados e movidos para outros nós ou promovidos a nó.

source: Enable grafting on the following node types
pt_pt: Activar enxertos nos seguintes tipos de nó

source: These node types allow grafting of pruned nodes and comments.
pt_pt: Estes tipos de nós permitem enxerto de nós e comentários podados.

source: Enable promotion to the following node types
pt_pt: Activar promoção para os seguintes tipos de nó

source: Comments can be promoted to these nodetypes. Note that this doesn't make sense for certain node types (poll, for example).
pt_pt: Comentários podem ser promovidos para estes tipos de nó. Note que isto não faz sentido para certos tipos de nó (votações, por exemplo).

source: Move comments to other threads or convert them to nodes.
pt_pt: Mova comentários para outros tópicos ou converta-os em nós.
